Tekla.Structures.Model.ModelObject.ModelObjectEnum
All possible concrete model object subclasses are defined here. This enumeration can be used to
fetch certain types of objects from the Tekla Structures model.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.UNKNOWN
The unknown model object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BEAM
The beam.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.POLYBEAM
The polybeam.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONTOURPLATE
The contour plate.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BOOLEANPART
The boolean part.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.FITTING
The fitting.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CUTPLANE
The cutplane.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.SURFACE_TREATMENT
The surface treatment.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.WELD
The weld.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.ASSEMBLY
The assembly.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.SINGLEREBAR
The single rebar.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBARGROUP
The rebar group.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBARMESH
The rebar mesh.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBARSTRAND
The rebar strand.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONTROL_PLANE
The control plane.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BOLT_ARRAY
The bolt array.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BOLT_CIRCLE
The bolt circle.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BOLT_XYLIST
The bolt XY list.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LOAD_POINT
The point load.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LOAD_LINE
The line load.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LOAD_AREA
The area load.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LOAD_UNIFORM
The uniform load.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.GRID
The grid.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.GRIDPLANE
The grid plane.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONNECTION
The connection.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.COMPONENT
The component.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.SEAM
The seam.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.DETAIL
The detail.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REFERENCE_MODEL
The reference model.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_SPLICE
The rebar splice.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LOAD_GROUP
The load group.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.TASK
The task.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.TASK_DEPENDENCY
The task dependency.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.TASK_WORKTYPE
The task worktype.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.POLYGON_WELD
The polygon weld.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LOGICAL_WELD
The logical weld.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CIRCLEREBAR
The circle rebar.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.HIERARCHIC_DEFINITION
The hierarchic definition.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.HIERARCHIC_OBJECT
The hierarchic object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.ANALYSIS_GEOMETRY
The analysis geometry.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.ANALYSIS_PART
The analysis part.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REFERENCE_MODEL_OBJECT
The reference model object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CUSTOM_PART
The custom part object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CIRCLE_REBARGROUP
The circle rebar group.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CURVED_REBARGROUP
The curved rebar group.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.EDGE_CHAMFER
The edge chamfer.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.POUR_OBJECT
The pour object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.POUR_BREAK
The pour break.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONTROL_LINE
The control line.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LOAD_TEMPERATURE
The temperature load.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BREP
The Brep part instance.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONTROL_CIRCLE
The control circle.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONTROL_POINT
The control point.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_SET
The rebar set.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_SET_ADDITION
The rebar set addition.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_PROPERTY_MODIFIER
The rebar property modifier.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_END_DETAIL_MODIFIER
The rebar end-detail modifier.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_SPLITTER
The rebar splitter.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.SURFACE_OBJECT
The surface object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BENT_PLATE
The bent plate.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.SPIRAL_BEAM
The part with helix geometry.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.POUR_UNIT
The pour unit.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONTROL_ARC
Construction arc.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONTROL_SPLINE
Construction spline

Tekla.Structures.Model.ModelObject.ModelObjectEnum.CONTROL_POLYCURVE
Construction polycurve

Tekla.Structures.Model.ModelObject.ModelObjectEnum.RADIAL_GRID
Radial grid

Tekla.Structures.Model.ModelObject.ModelObjectEnum.GRID_CYLINDRICAL_SURFACE
Cylindrical surfaces of radial grids

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LOFTED_PLATE
The lofted plate

Tekla.Structures.Model.ModelObject.ModelObjectEnum.LEG_SURFACE_OBJECT
The leg surface object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.STOREY
The storey object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.SPACE
The building space object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BUILDING
The building space object.

Tekla.Structures.Model.ModelObject.ModelObjectEnum.BUILDING_SITE
The site object.